{
  "articles": [
    {
      "id": 1,
      "topic": "Property Management",
      "date": "January 1, 2024",
      "title": "Demographics Of The Philippines Statistics And Facts",
      "image": "./assets/img/A1.png",
      "content": "<p>With over 111 million people, the Philippines was among the most populated countries in the Asia Pacific, next to Japan. Deep-seated Catholic beliefs influenced the nation’s pro-life stance and aided the population boom. However, the country’s population reflected sluggish growth in the past decade as evidenced by the declining fertility rates partly due to the increased use of contraceptives and modern family planning methods.</p><br><h3>A young demographic</h3><p>The Philippines has a young population, with about 64 percent of people between the ages of 15 and 64 years.<br>Meanwhile, over 30 percent are between zero to 14 years old.<br>In 2019, the mean age of male household members was 37.68 years while female members had a mean age of 44.2 years.<br>The country’s young people were seen to significantly contribute to the country’s economic recovery after experiencing prolonged COVID-19-related lockdowns.</p><h3>Urbanization and migration</h3><p>Despite the slow growth, the country’s population density remains among the highest in the region.<br>However, the distribution of people was uneven as more Filipinos chose to live in urban areas where work opportunities remain abundant.<br>As of May 2020, the regions of CALABARZON and the National Capital Region (NCR) accounted for the highest number of inhabitants nationwide.<br>This, in turn, created an income disparity among major capitals.<br>In addition, the country saw a growing slum community that has been an ongoing societal issue in major urban cities.</p><p>In terms of migration, the country has developed an emigration culture, where one out of five Filipinos expressed desires to move abroad.<br>The government also relies on this emigration culture and has positioned the country as the leading labor exporter from Asia-Pacific.<br>This text provides general information.<br>Statista assumes no liability for the information given being complete or correct.<br>Due to varying update cycles, statistics can display more up-to-date data than referenced in the text.</p><p>Research by Luzette Qader</p>Published by Statista Research Department, Jan 31, 2023",
      "author": "Luzette Qader"
    },
    {
      "id": 2,
      "topic": "Brokerage",
      "date": "January 2, 2024",
      "title": "Real Estate Industry In The Philippines Statistics And Facts",
      "image": "./assets/img/A2.png",
      "content": "<h3>Residential real estate in the Philippines</h3><p> Residential real estate in the Philippines comprises a wide range of residential properties, from public and private housing to mid-range subdivisions, condominiums, and high-class villages. In 2020, a survey revealed that most Filipino households live in a single-house unit, with more than half owning the property or having an owner-like possession. For metropolitan cities like Metro Manila, renting apartments, purchasing rent-to-own units in subdivisions, and taking a lease in a condominium is quite common. The average selling price would depend on the area of the property, reaching as much as 220 thousand Philippine pesos per square meter for a condo unit.</p><br><p>However, the exodus of households from rural areas left the demand for affordable housing at an all-time high. As a result, there has been a growing and constant demand for socialized and low-cost housing among low-income families. On top of that, the Philippines’ geographical location makes it susceptible to natural disasters, further challenging the country’s housing situation. To address the housing gap, government agencies and the private sector adopted a resolution that would expedite the inventory of idle government lands and fast-track the development and release of socialized housing for the growing number of informal settlers.</p><br><h3>State of commercial real estate</h3><br><p>Commercial real estate, composed of office space, industrial, retail, and hospitality properties, is slowly recovering from the impacts of the COVID-19 pandemic. Office space demand is dominated by the IT-BPM sector, although the Philippine offshore gaming operators (POGO) industry is expected to return in the coming months. The vacancy rate of office spaces also shows improvements in the coming years as companies re-occupy office spaces.</p><br><p>Retail real estate has also shown improvements in the vacancy rate, especially in the cities of Taguig and Makati, where most shopping malls and retail outlets are located. Food, beverage, clothing, and apparel will continue to lead the country's upcoming retail real estate supply. This text provides general information. Statista assumes no liability for the information given being complete or correct. Due to varying update cycles, statistics can display more up-to-date data than referenced in the text.</p><br><p>Published by Statista Research Department, Jan 12, 2023 Research by Luzette Qader</p>",
      "author": "Luzette Qader"
    },
    {
      "id": 3,
      "topic": "Listing",
      "date": "",
      "title": "Navigating Land Title Transfer Fees In The Philippines.",
      "image": "./assets/img/A3.png",
      "content": "<p>Navigating Land Title Transfer Fees in the Philippines </p><p>Transferring land titles, be it a certificate of title or a condominium certificate of title, in the Philippines involves a multifaceted array of fees. While the conventional approach dictates shared responsibility between sellers and buyers, flexible arrangements can be negotiated, provided they are mutually agreed upon before the signing of the Deed of Sale.</p><p>Unraveling the Standard Procedures for Fees:</p><p>Capital Gains Tax (CGT): Sellers bear the responsibility for the Capital Gains Tax, a fixed 6% of the total contract price or the selling price stated in the Deed of Sale, opting for the higher amount. For sellers who are corporations or actively engage in real estate selling, Withholding Tax applies. Additionally, sellers must settle any outstanding real estate taxes and cover the commission of the licensed real estate broker or brokerage agency facilitating the transaction.</p><p>Buyer's Responsibilities:</p><p>Documentary Tax (1.5%): Buyers are tasked with shouldering the Documentary Tax, equivalent to 1.5% of the selling price or zonal value, whichever is greater.</p><p>Transfer Tax (Location-Specific Rates): Buyers are obligated to pay the Transfer Tax, with the exact percentage varying based on the property's location. For properties in Metro Manila and key cities, specific rates apply, approximately ranging from 0.5% to 0.75%, offering a nuanced understanding of the financial commitment. In contrast, properties in provinces or municipalities have distinct rates, adding a layer of complexity to the overall transfer process.</p><p>Registration Fee (Property Value-Dependent): The Registration Fee, calculated as a percentage of the property's value, is within the buyer's responsibilities. Notably, properties in Metro Manila and key cities carry different rates compared to those in provinces or municipalities. For instance, in Metro Manila, the registration fee is approximately 0.75% of the property's value, emphasizing the need for location-specific insights.</p><p>Value Added Tax (VAT): Rate: The Value Added Tax (VAT) is typically set at 12%. Applicability: Buyers are generally responsible for the Value Added Tax. It applies to the sale of new residential properties and lots exceeding ?3,199,200.</p><p>Educational Fund Fee: Rate: Usually around 1% of the property's selling price. Applicability: The Educational Fund Fee is a mandatory contribution to the Education Fund of the local government unit. Buyers are commonly responsible for this fee.</p><p>Business Tax: Rate: Business Tax rates can vary based on the local government's regulations. Applicability: Business Tax, when applicable, is generally borne by the seller. It applies to transactions involving properties held for business purposes.</p><p>Notarial Fee: Buyers cover the Notarial Fee, encompassing the legal documentation associated with the property transfer, ensuring a smooth transition of ownership.</p><p>Incidental and Miscellaneous Expenses: Buyers are accountable for any additional incidental and miscellaneous expenses arising during the registration and transfer process, emphasizing the importance of thorough financial planning.</p><p>Agreements and Considerations:</p><p>Mutual Agreements: While standard procedures exist, sellers and buyers retain the flexibility to mutually agree on alternative terms concerning fee distribution before finalizing the Deed of Sale. This allows for a personalized approach tailored to the specific circumstances of the transaction.</p><p>Disclaimers and Suggestions:</p><p>Consultation with Professionals: The information provided is a general overview, and real estate transactions can be complex. It is strongly recommended that individuals consult with legal, tax, and real estate professionals to obtain personalized advice based on their specific situation.</p><p>Legal and Tax Implications: Real estate transactions involve legal and tax implications that may vary based on individual circumstances. Professional advice can provide clarity on these aspects and ensure compliance with current regulations.</p><p>Location-Specific Guidance: Rates and regulations can differ based on the location of the property. Seeking advice from professionals familiar with local laws and practices is essential for accurate and location-specific information.</p><p>By providing a detailed insight into transfer fee rates and registration fees, both in Metro Manila and key cities and in provinces or municipalities, this comprehensive guide aims to empower individuals navigating the complex landscape of land title transfers in the Philippines. Understanding the specific taxes and fees applicable to each transaction type enhances transparency and facilitates informed decision-making in real estate transactions.</p>",
      "author": ""
    },
    {
      "id": 4,
      "topic": "Property Management",
      "date": "",
      "title": "Processes In Investing On A Real Estate Property",
      "image": "./assets/img/A4.png",
      "content": "<strong>For your guidance, here are the standard steps in purchasing a real estate property: </strong><ul><li>INQUIRY. This is when the client expresses interest in a project.</li><li>SETTING OF TRIPPING This is when the salesperson orients the client and shows him/her around the project.</li><li>RESERVATION: Once the client decides on which project he/she likes, he/she pays the reservation fee to hold the particular unit.</li><li>DOWNPAYMENT: This is when the buyer pays his initial investment to the seller.</li><li>CONTRACT SIGNING: Here is when the buyer sign the agreement and issue PDC's if required by the seller.</li><li>SUBMISSION OF REQUIRED DOCUMENT: This includes the Contract to Sell, Identification Cards, Proof billings, Photos, etc.</li><li>PROCESSING OF FINANCING: Buyer fill-up the bank loan application form. The buyer should start accomplishing the required docs for bank financing after the Reservation. These include the proof of income, pay slips, income tax return, financial statement, IDs,</li><li>TRANSFER OF TITLE: Should the client opt to pay through bank financing, the title of the property will remain in the possession of the bank until the full amount has been paid.</li><li>MOVE-IN. This is after the seller turn-over the unit to the buyer.</li></ul>",
      "author": ""
    },
    {
      "id": 5,
      "topic": "Distressed Assets",
      "date": "",
      "title": "Real Estate Online Band Wagon!",
      "image": "./assets/img/A5.png",
      "content": "<p>These days, people have been so busy with their hectic schedules that the aid of technology, the internet to be more specific, had become a necessity. It has even come to the point that more and more businesses are hopping on the internet bandwagon and operate online.</p><br><p>This is the trend that our company strives to flourish on. Philproperties International Corporation is a professional online real estate marketing company which has been providing not only excellent projects and services to clients but competitive compensation rates and incentives to our sales force. If you are in the real estate business or want to be in it, Philproperties International Corporation is a company that will welcome and provide you with the tools that will help you on your way to success.</p>",
      "author": ""
    }
  ]
}